#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>


//小乐乐从老师口中听到了二段数这个名词，想更深入的了解二段数。
//二段数是这样的正整数：恰好包含两种不同的十进制数字s和t，s不是0，并且s的所有出现均排列在所有的t的前面。
//例如，44444411是二段数（s是4，t是1），41、10000000和5555556也是。但4444114和44444都不是二段数。
//这时老师问小乐乐：给你一个任意的正整数n，你能求出比n大并且是n的倍数的最小二段数吗？请你帮助小乐乐解答这个问题。
//
//输入描述：
//多组输入，每组输入包含一个正整数n(1 ≤ n ≤ 99999)
//题目保证测试数据总数不超过500组，当输入n = 0时程序结束。
// 
//输出描述：
//对于每组测试用例，输出正整数n，后面紧跟“ : ”，输出答案并换行，即比n大且是n的倍数的最小二段数。
// 
//示例1
//输入：
//1
//2019
//0
//输出：
//1: 10
//2019 : 9999999993

//判断是否为二段数
//int judge(int a[5], int b)
//{
//    int count = 0;
//    int i = 0;
//    int num = sizeof(b);
//    do {
//        for (i = 0; i < num - 1; i++)//循环数字-1次对比
//        {
//            if (a[i] == a[i + 1])
//            {//对比相邻位是否相等
//                count++;
//            }
//            if (count > 2 || b < 10)
//            {
//                return 1;
//            }
//            return 0;
//        }
//    } while (1);
//
//
//}

//
int Wei(long long int a)
{

    int count = 0;;
    do
    {
        count++;
        a /= 10;

    } while (a != 0);

    return count;

}





int main()
{
    int a = 0;
    scanf("%d", &a);
    
    

    //int i = 0;
    //int d = a;
    //int num = 0;//有几个数字
    //for (i = 0; i < 5; i++)
    //{
    //    if (d / (10 ^ i) != 0)
    //    {
    //        num++;
    //    }
    //}


    //数字赋给数组
    //int k = 0;
    //do
    //{
    //    c[num - k - 1] = d % 10;
    //    d /= 10;
    //    k++;
    //} while (d != 0);


    //每次加1，若结果为二段数则退出
    do {
        b += a;


    } while (judge(c[5], b));



    printf("%d: %lld\n", &a, b);
    return 0;
}